ErpTest/src/Documents/пкАктСверкиВзаиморасчетов/пкАктСверкиВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкАктСверкиВзаиморасчетов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериодаСверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериодаСверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СверкаСогласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СальдоНаНачалоПоДаннымОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СальдоНаКонецПоДаннымОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СальдоНаНачалоПоДаннымКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СальдоНаКонецПоДаннымКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителяКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРуководителяКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоДаннымОрганизации</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоДаннымКонтрагента</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДебетКонтрагента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КредитКонтрагента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаУчетаРасчетов</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВРасчетах</name>
      <comment>Признак использования счета при проведении сверки</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоговорыКонтрагента</name>
    <attributes>
      <name>ДоговорыКонтрагентов</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

ErpTest/src/Documents/пкАктСверкиВзаиморасчетов/Forms/ФормаДокумента/Module.bsl
#Область СчетаУчетаРасчетов

&НаКлиенте
Процедура ЗаполнитьСчетаПоУмолчанию(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Заполнить?",Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе	
		ЗаполнитьСчетаПоУмолчаниюНаСервере();
	КонецЕсли;
	
	
КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьСчетаПоУмолчаниюНаСервере()
	
	Объект.СчетаУчетаРасчетов.Очистить();
	
	СчетаПоУмолчанию = Новый Массив();
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СчетаПоУмолчанию.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	
	Для каждого СтрокаМассиваСчетов Из СчетаПоУмолчанию Цикл
		
		СтрокаСчетовУчета = Объект.СчетаУчетаРасчетов.Добавить();
		СтрокаСчетовУчета.Счет = СтрокаМассиваСчетов;
		СтрокаСчетовУчета.УчаствуетВРасчетах = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПоДаннымОрганизации
&НаСервере
Процедура ЗаполнитьНаСервере(ИмяТЧ)
	
	Если не  ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщить("Контрагент не заполнен!");
		Возврат;
	КонецЕсли;
	
	Если не  ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Организация не заполнена!");
		Возврат;
	КонецЕсли;
	
	Если не  ЗначениеЗаполнено(Объект.ДатаНачалаПериодаСверки) Тогда
		Сообщить("Не заполнена дата начала периода сверки!");
		Возврат;
	КонецЕсли;
	
	Если не  ЗначениеЗаполнено(Объект.ДатаОкончанияПериодаСверки) Тогда
		Сообщить("Не заполнена дата окончания периода сверки!");
		Возврат;
	КонецЕсли;
	
	Если не  ЗначениеЗаполнено(Объект.Валюта) Тогда
		Сообщить("Не заполнена валюта!");
		Возврат;
	КонецЕсли;
	
	ВалютаДокумента = ?(Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить(), неопределено,Объект.Валюта);
	
	ОтборПоДоговорам = ?(Объект.ДоговорыКонтрагента.Количество() = 0, неопределено,истина);
	
	Договоры = ?(ОтборПоДоговорам = неопределено,неопределено,Объект.ДоговорыКонтрагента.Выгрузить(,"ДоговорыКонтрагентов").ВыгрузитьКолонку("ДоговорыКонтрагентов"));
	
	СписокСубконто = Новый Массив; 
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);

	
	МассивСчетов = Новый Массив;
	Для каждого СтрокаМассиваСчетов Из Объект.СчетаУчетаРасчетов Цикл
		Если СтрокаМассиваСчетов.УчаствуетВРасчетах Тогда
			 МассивСчетов.Добавить(СтрокаМассиваСчетов.Счет);
		КонецЕсли;		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|			ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт
	|		КОНЕЦ) КАК Дебет,
	|	СУММА(ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|			ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт
	|		КОНЕЦ) КАК Кредит,
	|	ХозрасчетныйОбороты.Период КАК Дата,
	|	ХозрасчетныйОбороты.Регистратор КАК Документ,
	|	ХозрасчетныйОбороты.Субконто2 КАК ДоговорКонтрагента,
	|	СУММА(ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|			ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт
	|		КОНЕЦ) КАК КредитКонтрагента,
	|	СУММА(ВЫБОР
	|			КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|			ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт
	|		КОНЕЦ) КАК ДебетКонтрагента
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&ДатаНачалаПериодаСверки,
	|			&ДатаОкончанияПериодаСверки,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (&МассивСчетов),
	|			&СписокСубконто,
	|			Организация = &Организация
	|				И Субконто1 = &Контрагент
	|				И ВЫБОР
	|					КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|						ТОГДА Валюта ЕСТЬ NULL
	|					ИНАЧЕ Валюта = &Валюта
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ОтборПоДоговорам = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Субконто2 В (&Договоры)
	|				КОНЕЦ,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивСчетов)
	|				ТОГДА ВЫБОР
	|						КОГДА &ОтборПоДоговорам = НЕОПРЕДЕЛЕНО
	|							ТОГДА НЕ ХозрасчетныйОбороты.КорСубконто1 В (&Контрагент)
	|						ИНАЧЕ НЕ ХозрасчетныйОбороты.КорСубконто1 = &Контрагент
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ(ВЫБОР
	|					КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|						ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|					ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт
	|				КОНЕЦ = 0
	|				И ВЫБОР
	|					КОГДА &Валюта = НЕОПРЕДЕЛЕНО
	|						ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|					ИНАЧЕ ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт
	|				КОНЕЦ = 0)
	|	И НЕ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Субконто2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ";
	
	ДляВалюты = "
	|
	|				И НЕ ХозрасчетныйОбороты.Регистратор.Ссылка ССЫЛКА Документ.ПереоценкаВалютныхСредств
	|				И НЕ ХозрасчетныйОбороты.Регистратор.Ссылка ССЫЛКА Документ.РегламентнаяОперация
	|УПОРЯДОЧИТЬ ПО";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериодаСверки", Объект.ДатаНачалаПериодаСверки);
	Запрос.УстановитьПараметр("ДатаОкончанияПериодаСверки", Новый Граница(КонецДня(Объект.ДатаОкончанияПериодаСверки),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СписокСубконто", СписокСубконто);
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента);
	Запрос.УстановитьПараметр("ОтборПоДоговорам", ОтборПоДоговорам);
	Запрос.УстановитьПараметр("Договоры",Договоры);
	
	//Если НЕ ВалютаДокумента = Неопределено Тогда
	//	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"УПОРЯДОЧИТЬ ПО",ДляВалюты);
	//	
	//КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
	   Объект[ИмяТЧ].Загрузить(РезультатЗапроса.Выгрузить());
	Иначе
		Сообщить("Взаиморасчетов нет!");
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
		|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
		|	КОНЕЦ КАК СальдоНаНачало
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&ДатаНачалаПериодаСверки,
		|			Счет В ИЕРАРХИИ (&МассивСчетов),
		|			&СписокСубконто,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент
		|				И ВЫБОР
		|					КОГДА &Валюта = НЕОПРЕДЕЛЕНО
		|						ТОГДА Валюта Есть null
		|					ИНАЧЕ Валюта = &Валюта
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоДоговорам = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто2 В (&Договоры)
		|				КОНЕЦ) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Валюта = НЕОПРЕДЕЛЕНО
		|			ТОГДА ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
		|	КОНЕЦ КАК СальдоНаКонец,
		|	ВТ.СальдоНаНачало
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&ДатаОкончанияПериодаСверки,
		|			Счет В ИЕРАРХИИ (&МассивСчетов),
		|			&СписокСубконто,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент
		|				И ВЫБОР
		|					КОГДА &Валюта = НЕОПРЕДЕЛЕНО
		|						ТОГДА Валюта Есть null
		|					ИНАЧЕ Валюта = &Валюта
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ОтборПоДоговорам = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Субконто2 В (&Договоры)
		|				КОНЕЦ) КАК ХозрасчетныйОстатки,
		|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериодаСверки", Новый Граница(НачалоДня(Объект.ДатаНачалаПериодаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияПериодаСверки", Новый Граница(КонецДня(Объект.ДатаОкончанияПериодаСверки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СписокСубконто", СписокСубконто);
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента);
    Запрос.УстановитьПараметр("Договоры",Договоры);
	Запрос.УстановитьПараметр("ОтборПоДоговорам", ОтборПоДоговорам);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ИмяТЧ = "ПоДаннымОрганизации" Тогда
		Объект.СальдоНаНачалоПоДаннымОрганизации = ВыборкаДетальныеЗаписи.СальдоНаНачало;
		Объект.СальдоНаКонецПоДаннымОрганизации = ВыборкаДетальныеЗаписи.СальдоНаКонец;
	Иначе
		Объект.СальдоНаНачалоПоДаннымКонтрагента = -1*ВыборкаДетальныеЗаписи.СальдоНаНачало;
		Объект.СальдоНаКонецПоДаннымКонтрагента = -1*ВыборкаДетальныеЗаписи.СальдоНаКонец;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОрганизации(Команда)
	
	
	Если Объект.ПоДаннымОрганизации.Количество() > 0 Тогда
		 Объект.ПоДаннымОрганизации.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере("ПоДаннымОрганизации");
	//ИзменитьСальдоКонечноеПоТЧ("ПоДаннымОрганизации");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.СчетаУчетаРасчетов.Количество() = 0 Тогда
		ЗаполнитьСчетаПоУмолчаниюНаСервере();	
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ДатаНачалаПериодаСверки) Тогда
		Объект.ДатаНачалаПериодаСверки = НачалоГода(ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияПериодаСверки) Тогда
		Объект.ДатаОкончанияПериодаСверки = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
		Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтрагентаПоОрганизации(Команда)
	
	Если Объект.ПоДаннымКонтрагента.Количество() > 0 Тогда
		 Объект.ПоДаннымКонтрагента.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере("ПоДаннымКонтрагента");
	//ПоДаннымКонтрагентаСуммаПриИзменении("ПоДаннымКонтрагента");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСальдоКонечноеПоТЧ(ИМЯТЧ)
	
	Если ИмяТЧ = "ПоДаннымОрганизации" ТОГДА
		Объект.СальдоНаКонецПоДаннымОрганизации = Объект.СальдоНаНачалоПоДаннымОрганизации + Объект.ПоДаннымОрганизации.Итог("Дебет") - Объект.ПоДаннымОрганизации.Итог("Кредит");
	Иначе
		Объект.СальдоНаКонецПоДаннымКонтрагента = Объект.СальдоНаНачалоПоДаннымОрганизации + Объект.ПоДаннымКонтрагента.Итог("КредитКонтрагента") - Объект.ПоДаннымКонтрагента.Итог("ДебетКонтрагента");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымОрганизацииСуммыПриИзменении(Элемент)
	ИзменитьСальдоКонечноеПоТЧ("ПоДаннымОрганизации");	
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымКонтрагентаСуммаПриИзменении(Элемент)
	ИзменитьСальдоКонечноеПоТЧ("ПоДаннымКонтрагента");	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьТаблицыВзаиморачсетов();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицыВзаиморачсетов()
	Объект.ПоДаннымОрганизации.Очистить();
	Объект.ПоДаннымКонтрагента.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОчиститьТаблицыВзаиморачсетов();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПериодаСверкиПриИзменении(Элемент)
	ОчиститьТаблицыВзаиморачсетов();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаСверкиПриИзменении(Элемент)
	ОчиститьТаблицыВзаиморачсетов();
КонецПроцедуры
